mercedes_stationwagon/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            patch;
        nFaces          320;
        startFace       349386;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       349706;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       349770;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4037;
        startFace       349834;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       353871;
    }
    mercedes_stationwagon
    {
        type            wall;
        inGroups        2(mercedes_stationwagonGroup wall);
        nFaces          21251;
        startFace       354031;
    }
)

// ************************************************************************* //
